[
    {
        "title": "Large-Scale AI in Telecom: Charting the Roadmap for Innovation, Scalability, and Enhanced Digital Experiences",
        "author": "Adnan Shahid, Adrian Kliks, Ahmed Al-Tahmeesschi, Ahmed Elbakary, Alexandros Nikou, Ali Maatouk, A. Mokh, Amirreza Kazemi, Antonio De Domenico, Athanasios Karapantelakis, Bo Cheng, Bo Yang, Bohao Wang, Carlo Fischione, Chao Zhang, Chaouki Ben Issaid, Chau Yuen, Chen-Shuo Peng, Chongwen Huang, C. Chaccour, C. K. Thomas, Dheeraj Sharma, Dimitris Kalogiros, Dusit Niyato, E. D. Poorter, Elissa Mhanna, E. Strinati, Faouzi Bader, Fathi Abdeldayem, Fei Wang, Feng-zheng Zhu, G. Fontanesi, Giovanni Geraci, Haibo Zhou, Hakimeh Purmehdi, Hamed Ahmadi, Han Zou, Hongyang Du, Hoon Lee, Howard H. Yang, Iacopo Poli, I. Carron, Ilias Chatzistefanidis, Inkyu Lee, Ioannis Pitsiorlas, Jaron Fontaine, Jiajun Wu, Jie Zeng, Jinan Li, Jinane Karam, Johny Gemayel, Juan Deng, Julien Frison, Kaibin Huang, Kehai Qiu, Keith Ball, Kezhi Wang, Kun Guo, L. Tassiulas, Lecorve Gwenole, Liexiang Yue, Lina Bariah, Louis Powell, Marcin Dryjański, Maria Amparo Canaveras Galdon, M. Kountouris, Maryam Hafeez, Maxime Elkael, Mehdi Bennis, M. Boudjelli, M. Dai, Mérouane Debbah, Michele Polese, M. Assaad, Mohamed Benzaghta, Mohammad Hayel Al Refai, Moussab Djerrab, Mubeen Syed, Muhammad Amir, Na Yan, N. Alkaabi, Nan Li, Nassim Sehad, Navid Nikaein, Omar Hashash, Paweł Sroka, Qianqian Yang, Qiyang Zhao, Rasoul Nikbakht Silab, Rex Ying, Roberto Morabito, Rongpeng Li, Ryad Madi, Salah Eddine El Ayoubi, Salvatore D’oro, S. Lasaulce, Serveh Shalmashi, Sige Liu, Sihem Cherrared, S. Chetty, Swastika Dutta, S. A. Zaidi, Tianjiao Chen, Timothy Murphy, Tommaso Melodia, Tony Q. S. Quek, Vishnu Ram, Walid Saad, W. Hamidouche, Weilong Chen, Xiaoou Liu, Xiaoxue Yu, Xijun Wang, Xingyu Shang, Xinquan Wang, Xue Cao, Yang Su, Yanping Liang, Yansha Deng, Yifan Yang, Ying Cui, Yu Sun, Yuxuan Chen, Y. Pointurier, Z. Nehme, Zeinab Nezami, Zhaohui Yang, Zhaoyang Zhang, Zhe Liu, Zhenyu Yang, Zhu Han, Zhuangyao Zhou, Zihan Chen, Zirui Chen, Zitao Shuai",
        "venue": "arXiv.org",
        "year": 2025,
        "url": "https://www.semanticscholar.org/paper/3e6e4b23265fd2852aac3b8d75903e4499d4e319"
    },
    {
        "title": "MTBench: A Multimodal Time Series Benchmark for Temporal Reasoning and Question Answering",
        "author": "Jialin Chen, Aosong Feng, Ziyu Zhao, Juan Garza, G. Nurbek, Cheng Qin, Ali Maatouk, L. Tassiulas, Yifeng Gao, Rex Ying",
        "venue": "arXiv.org",
        "year": 2025,
        "url": "https://www.semanticscholar.org/paper/4ca680d5493dcf0a0ea7cb8aca736f922e80e6df"
    },
    {
        "title": "Weighted Over-the-Air Federated Learning",
        "author": "Seyed Mohammad Azimi-Abarghouyi, L. Tassiulas, Carlo Fischione",
        "venue": "2025 IEEE International Conference on Machine Learning for Communication and Networking (ICMLCN)",
        "year": 2025,
        "url": "https://www.semanticscholar.org/paper/61e4149cc9aaead80c480eb611d0c0a76dc3e087"
    },
    {
        "title": "D2Q Synchronizer: Distributed SDN Synchronization for Time Sensitive Applications",
        "author": "Ioannis Panitsas, Akrit Mudvari, L. Tassiulas",
        "venue": "2025 IEEE International Conference on Machine Learning for Communication and Networking (ICMLCN)",
        "year": 2025,
        "url": "https://www.semanticscholar.org/paper/6716f4e4ced0ea83b43990fafcf26ffc492f00b4"
    },
    {
        "title": "Scheduling in Quantum Satellite Networks: Fairness and Performance Optimization",
        "author": "Ashutosh Jayant Dikshit, Naga Lakshmi Anipeddi, Prajit Dhara, Saikat Guha, Deirdre Kilbane, L. Tassiulas, Don Towsley, Nitish K. Panigrahy",
        "venue": "arXiv.org",
        "year": 2025,
        "url": "https://www.semanticscholar.org/paper/6823156b1efdc1b766f4d7418a28085a9fdcccc0"
    },
    {
        "title": "Ethereum Price Prediction Employing Large Language Models for Short-term and Few-shot Forecasting",
        "author": "Eftychia Makri, Georgios Palaiokrassas, Sarah Bouraga, Antigoni Polychroniadou, L. Tassiulas",
        "venue": "arXiv.org",
        "year": 2025,
        "url": "https://www.semanticscholar.org/paper/95d0b5a14c6b9361b1d12d59c38e4f3cef97c819"
    },
    {
        "title": "JamShield: A Machine Learning Detection System for Over-the-Air Jamming Attacks",
        "author": "Ioannis Panitsas, Yagmur Yigit, L. Tassiulas, Leandros A. Maglaras, Berk Canberk",
        "venue": "ICC 2025 - IEEE International Conference on Communications",
        "year": 2025,
        "url": "https://www.semanticscholar.org/paper/9c9bd6bf64f668a099663aaae62bacb0e2d788c4"
    },
    {
        "title": "SlicePilot: Demystifying Network Slice Placement in Heterogeneous Cloud Infrastructures",
        "author": "Ioannis Panitsas, Tolga O. Atalay, Dragoslav Stojadinovic, A. Stavrou, L. Tassiulas",
        "venue": "arXiv.org",
        "year": 2025,
        "url": "https://www.semanticscholar.org/paper/9f0219adf581ba7db9954bed276cf656011a21d0"
    },
    {
        "title": "Multi-policy reinforcement learning for network resource allocation with periodic behaviors",
        "author": "Zheyu Chen, Kin K. Leung, Shiqiang Wang, L. Tassiulas, Kevin S. Chan, Patrick J. Baker",
        "venue": "Comput. Networks",
        "year": 2025,
        "url": "https://www.semanticscholar.org/paper/9f3e8c8fd256474ce1f8454bad74a4cc22573abe"
    },
    {
        "title": "FedJam: Multimodal Federated Learning Framework for Jamming Detection",
        "author": "Ioannis Panitsas, Iason Ofeidis, L. Tassiulas",
        "venue": "arXiv.org",
        "year": 2025,
        "url": "https://www.semanticscholar.org/paper/a818e49b76caba59abdd71724b3fc8e223eca03e"
    },
    {
        "title": "5GC-Bench: A Framework for Stress-Testing and Benchmarking 5G Core VNFs",
        "author": "Ioannis Panitsas, Tolga O. Atalay, Dragoslav Stojadinovic, A. Stavrou, L. Tassiulas",
        "venue": "arXiv.org",
        "year": 2025,
        "url": "https://www.semanticscholar.org/paper/aa9ac4b7a76f096975fed85bb7f1e6fb01b536e5"
    },
    {
        "title": "HELM: Hyperbolic Large Language Models via Mixture-of-Curvature Experts",
        "author": "Neil He, Rishabh Anand, Hiren Madhu, Ali Maatouk, Smita Krishnaswamy, L. Tassiulas, Menglin Yang, Rex Ying",
        "venue": "arXiv.org",
        "year": 2025,
        "url": "https://www.semanticscholar.org/paper/b48eb1e524423cf35fd565cfd50c9a790e2ad85b"
    },
    {
        "title": "An LLM Agent-Based Framework for Analytical Characterization of Nash Equilibria",
        "author": "Wenxuan Liu, Xiyuan Zhou, Xinlei Wang, Yuheng Cheng, Lixin Ye, Randall Berry, L. Tassiulas, Jianwei Huang, Junhua Zhao",
        "venue": "Nexus",
        "year": 2025,
        "url": "https://www.semanticscholar.org/paper/d24612b20d0b95716a68db1545d984ee5dddabc9"
    },
    {
        "title": "TelecomTS: A Multi-Modal Observability Dataset for Time Series and Language Analysis",
        "author": "Austin Feng, Andreas Varvarigos, Ioannis Panitsas, Daniela Fernandez, Jinbiao Wei, Yuwei Guo, Jialin Chen, Ali Maatouk, L. Tassiulas, Rex Ying",
        "venue": "arXiv.org",
        "year": 2025,
        "url": "https://www.semanticscholar.org/paper/d68401e05c3420cc3fbe4d5c9b3d5cbe5e79d0b6"
    },
    {
        "title": "Towards Unsupervised Drift Detection in Programmable Data-Planes",
        "author": "Kaiyi Zhang, N. Samaan, Ahmed Karmouch, L. Tassiulas",
        "venue": "Proceedings of the ACM CoNEXT Workshop on In-Network Computing and AI for Distributed Systems",
        "year": 2025,
        "url": "https://www.semanticscholar.org/paper/d7223dc1648df116b72b761c03aea2a9be1ba10c"
    },
    {
        "title": "TRACE: Grounding Time Series in Context for Multimodal Embedding and Retrieval",
        "author": "Jialin Chen, Ziyu Zhao, G. Nurbek, Aosong Feng, Ali Maatouk, L. Tassiulas, Yifeng Gao, Rex Ying",
        "venue": "arXiv.org",
        "year": 2025,
        "url": "https://www.semanticscholar.org/paper/dd803543cf260c90d127bc9f0f1bdf1f140e970a"
    },
    {
        "title": "EC-Sense: Radio Energy Capture for Ultra-Low-Power Wireless Soil Moisture Sensing",
        "author": "Yoganand Biradavolu, Jian Ding, Bhuvana Krishnaswamy, L. Tassiulas, Vaishnavi Ranganathan",
        "venue": "Proceedings of the ACM on Interactive Mobile Wearable and Ubiquitous Technologies",
        "year": 2025,
        "url": "https://www.semanticscholar.org/paper/f962c978b1971985511f18220ca73206a3c2ca87"
    },
    {
        "title": "Agoran: An Agentic Open Marketplace for 6G RAN Automation",
        "author": "Ilias Chatzistefanidis, Navid Nikaein, Andrea Leone, Ali Maatouk, L. Tassiulas, Roberto Morabito, Ioannis Pitsiorlas, Marios Kountouris",
        "venue": "Computer Networks",
        "year": 2025,
        "url": "https://www.semanticscholar.org/paper/ffa966e697542388284465ff9f01b0cdf9cbd017"
    },
    {
        "title": "Cost-Effective Soil Carbon Sensing with Wi-Fi and Optical Signals",
        "author": "Jian Ding, Ranveer Chandra, Rattan Lal, L. Tassiulas",
        "venue": "ACM/IEEE International Conference on Mobile Computing and Networking",
        "year": 2024,
        "url": "https://www.semanticscholar.org/paper/038f7ae9b1ad0ef12f0a06db35df288183b82fd4"
    },
    {
        "title": "Scarf: Soil Carbon Sensing with Wi-Fi and Optical Signals",
        "author": "Jian Ding, Ranveer Chandra, Rattan Lal, L. Tassiulas",
        "venue": "ACM/IEEE International Conference on Mobile Computing and Networking",
        "year": 2024,
        "url": "https://www.semanticscholar.org/paper/30ee70d13733c00681c068a4190ab7edabd876d3"
    }
]