[
    {
        "title": "Large-Scale AI in Telecom: Charting the Roadmap for Innovation, Scalability, and Enhanced Digital Experiences",
        "author": "Adnan Shahid, Adrian Kliks, Ahmed Al-Tahmeesschi, Ahmed Elbakary, Alexandros Nikou, Ali Maatouk, A. Mokh, Amirreza Kazemi, Antonio De Domenico, Athanasios Karapantelakis, Bo Cheng, Bo Yang, Bohao Wang, Carlo Fischione, Chao Zhang, Chaouki Ben Issaid, Chau Yuen, Chen-Shuo Peng, Chongwen Huang, C. Chaccour, C. K. Thomas, Dheeraj Sharma, Dimitris Kalogiros, Dusit Niyato, E. D. Poorter, Elissa Mhanna, E. Strinati, Faouzi Bader, Fathi Abdeldayem, Fei Wang, Feng-zheng Zhu, G. Fontanesi, Giovanni Geraci, Haibo Zhou, Hakimeh Purmehdi, Hamed Ahmadi, Han Zou, Hongyang Du, Hoon Lee, Howard H. Yang, Iacopo Poli, I. Carron, Ilias Chatzistefanidis, Inkyu Lee, Ioannis Pitsiorlas, Jaron Fontaine, Jiajun Wu, Jie Zeng, Jinan Li, Jinane Karam, Johny Gemayel, Juan Deng, Julien Frison, Kaibin Huang, Kehai Qiu, Keith Ball, Kezhi Wang, Kun Guo, L. Tassiulas, Lecorve Gwenole, Liexiang Yue, Lina Bariah, Louis Powell, Marcin Dryjański, Maria Amparo Canaveras Galdon, M. Kountouris, Maryam Hafeez, Maxime Elkael, Mehdi Bennis, M. Boudjelli, Meiling Dai, Mérouane Debbah, Michele Polese, M. Assaad, Mohamed Benzaghta, Mohammad Hayel Al Refai, Moussab Djerrab, Mubeen Syed, Muhammad Amir, Na Yan, N. Alkaabi, Nan Li, Nassim Sehad, Navid Nikaein, Omar Hashash, Paweł Sroka, Qianqian Yang, Qiyang Zhao, Rasoul Nikbakht Silab, Rex Ying, Roberto Morabito, Rongpeng Li, Ryad Madi, Salah Eddine El Ayoubi, Salvatore D’oro, S. Lasaulce, Serveh Shalmashi, Sige Liu, Sihem Cherrared, S. Chetty, Swastika Dutta, S. A. Zaidi, Tianjiao Chen, Timothy Murphy, Tommaso Melodia, Tony Q. S. Quek, Vishnu Ram, Walid Saad, W. Hamidouche, Weilong Chen, Xiaoou Liu, Xiaoxue Yu, Xijun Wang, Xingyu Shang, Xinquan Wang, Xue Cao, Yang Su, Yanping Liang, Yansha Deng, Yifan Yang, Ying Cui, Yu Sun, Yuxuan Chen, Y. Pointurier, Z. Nehme, Zeinab Nezami, Zhaohui Yang, Zhaoyang Zhang, Zhe Liu, Zhenyu Yang, Zhu Han, Zhuangyao Zhou, Zihan Chen, Zirui Chen, Zitao Shuai",
        "venue": "arXiv.org",
        "year": 2025,
        "url": "https://www.semanticscholar.org/paper/3e6e4b23265fd2852aac3b8d75903e4499d4e319"
    },
    {
        "title": "MTBench: A Multimodal Time Series Benchmark for Temporal Reasoning and Question Answering",
        "author": "Jialin Chen, Aosong Feng, Ziyu Zhao, Juan Garza, G. Nurbek, Cheng Qin, Ali Maatouk, L. Tassiulas, Yifeng Gao, Rex Ying",
        "venue": "arXiv.org",
        "year": 2025,
        "url": "https://www.semanticscholar.org/paper/4ca680d5493dcf0a0ea7cb8aca736f922e80e6df"
    },
    {
        "title": "Ethereum Price Prediction Employing Large Language Models for Short-term and Few-shot Forecasting",
        "author": "Eftychia Makri, Georgios Palaiokrassas, Sarah Bouraga, Antigoni Polychroniadou, L. Tassiulas",
        "venue": "arXiv.org",
        "year": 2025,
        "url": "https://www.semanticscholar.org/paper/95d0b5a14c6b9361b1d12d59c38e4f3cef97c819"
    },
    {
        "title": "JamShield: A Machine Learning Detection System for Over-the-Air Jamming Attacks",
        "author": "Ioannis Panitsas, Yagmur Yigit, L. Tassiulas, Leandros A. Maglaras, Berk Canberk",
        "venue": "arXiv.org",
        "year": 2025,
        "url": "https://www.semanticscholar.org/paper/9c9bd6bf64f668a099663aaae62bacb0e2d788c4"
    },
    {
        "title": "LitFM: A Retrieval Augmented Structure-aware Foundation Model For Citation Graphs",
        "author": "Jiasheng Zhang, Ali Maatouk, Jialin Chen, Ngoc Bui, Qianqian Xie, L. Tassiulas, Hua Xu, Jie Shao, Rex Ying",
        "venue": "Proceedings of the 31st ACM SIGKDD Conference on Knowledge Discovery and Data Mining V.2",
        "year": 2025,
        "url": "https://www.semanticscholar.org/paper/a1a44ce18447c8090577fe5c45caa788634ae273"
    },
    {
        "title": "HELM: Hyperbolic Large Language Models via Mixture-of-Curvature Experts",
        "author": "Neil He, Rishabh Anand, Hiren Madhu, Ali Maatouk, Smita Krishnaswamy, L. Tassiulas, Menglin Yang, Rex Ying",
        "venue": "arXiv.org",
        "year": 2025,
        "url": "https://www.semanticscholar.org/paper/b48eb1e524423cf35fd565cfd50c9a790e2ad85b"
    },
    {
        "title": "On-Device Multimodal Federated Learning for Efficient Jamming Detection",
        "author": "Ioannis Panitsas, Iason Ofeidis, L. Tassiulas",
        "venue": "arXiv.org",
        "year": 2025,
        "url": "https://www.semanticscholar.org/paper/b97f7dbab433c5ef22bab475621a11c1b971b918"
    },
    {
        "title": "TRACE: Grounding Time Series in Context for Multimodal Embedding and Retrieval",
        "author": "Jialin Chen, Ziyu Zhao, G. Nurbek, Aosong Feng, Ali Maatouk, L. Tassiulas, Yifeng Gao, Rex Ying",
        "venue": "arXiv.org",
        "year": 2025,
        "url": "https://www.semanticscholar.org/paper/dd803543cf260c90d127bc9f0f1bdf1f140e970a"
    },
    {
        "title": "Cost-Effective Soil Carbon Sensing with Wi-Fi and Optical Signals",
        "author": "Jian Ding, Ranveer Chandra, Rattan Lal, L. Tassiulas",
        "venue": "ACM/IEEE International Conference on Mobile Computing and Networking",
        "year": 2024,
        "url": "https://www.semanticscholar.org/paper/038f7ae9b1ad0ef12f0a06db35df288183b82fd4"
    },
    {
        "title": "Scarf: Soil Carbon Sensing with Wi-Fi and Optical Signals",
        "author": "Jian Ding, Ranveer Chandra, Rattan Lal, L. Tassiulas",
        "venue": "ACM/IEEE International Conference on Mobile Computing and Networking",
        "year": 2024,
        "url": "https://www.semanticscholar.org/paper/30ee70d13733c00681c068a4190ab7edabd876d3"
    },
    {
        "title": "From Similarity to Superiority: Channel Clustering for Time Series Forecasting",
        "author": "Jialin Chen, J. E. Lenssen, Aosong Feng, Weihua Hu, Matthias Fey, L. Tassiulas, J. Leskovec, Rex Ying",
        "venue": "Neural Information Processing Systems",
        "year": 2024,
        "url": "https://www.semanticscholar.org/paper/39fbce781d28b36ad41bd897e0a0ca71a285351a"
    },
    {
        "title": "LitFM: A Retrieval Augmented Structure-aware Foundation Model For Citation Graphs",
        "author": "Jiasheng Zhang, Jialin Chen, Ali Maatouk, Ngoc Bui, Qianqian Xie, L. Tassiulas, Jie Shao, Hua Xu, Rex Ying",
        "venue": "arXiv.org",
        "year": 2024,
        "url": "https://www.semanticscholar.org/paper/426a2db9d0c96b1d43a948be7e827c9eb3a3b0b5"
    },
    {
        "title": "Maximizing Entanglement Rates via Efficient Memory Management in Flexible Quantum Switches",
        "author": "Panagiotis Promponas, Víctor Valls, Saikat Guha, L. Tassiulas",
        "venue": "IEEE Journal on Selected Areas in Communications",
        "year": 2024,
        "url": "https://www.semanticscholar.org/paper/43f41fb5e31eb761f24919c9907ccb4f203f3d50"
    },
    {
        "title": "SANDWICH: Towards an Offline, Differentiable, Fully-Trainable Wireless Neural Ray-Tracing Surrogate",
        "author": "Yifei Jin, Ali Maatouk, Sarunas Girdzijauskas, Shugong Xu, L. Tassiulas, Rex Ying",
        "venue": "arXiv.org",
        "year": 2024,
        "url": "https://www.semanticscholar.org/paper/485ce3a47b7b80fac6888ba4b19613fdae1445e4"
    },
    {
        "title": "SplitLLM: Collaborative Inference of LLMs for Model Placement and Throughput Optimization",
        "author": "Akrit Mudvari, Yuang Jiang, L. Tassiulas",
        "venue": "arXiv.org",
        "year": 2024,
        "url": "https://www.semanticscholar.org/paper/4956d7008724b77ab908f9b42116b1678750d56d"
    },
    {
        "title": "Tele-LLMs: A Series of Specialized Large Language Models for Telecommunications",
        "author": "Ali Maatouk, Kenny Chirino Ampudia, Rex Ying, L. Tassiulas",
        "venue": "arXiv.org",
        "year": 2024,
        "url": "https://www.semanticscholar.org/paper/579574a24bdc85f5305684f6be30c676707d433a"
    },
    {
        "title": "Machine Learning in DeFi: Credit Risk Assessment and Liquidation Prediction",
        "author": "Georgios Palaiokrassas, S. Scherrers, Eftychia Makri, L. Tassiulas",
        "venue": "International Conference on Blockchain",
        "year": 2024,
        "url": "https://www.semanticscholar.org/paper/5d60c3d10b9bf03a6d7552a681d664e2965aa18a"
    },
    {
        "title": "An Item is Worth a Prompt: Versatile Image Editing with Disentangled Control",
        "author": "Aosong Feng, Weikang Qiu, Jinbin Bai, Kaicheng Zhou, Zhen Dong, Xiao Zhang, Rex Ying, L. Tassiulas",
        "venue": "AAAI Conference on Artificial Intelligence",
        "year": 2024,
        "url": "https://www.semanticscholar.org/paper/5dfd011338b253b67d6dad30fd651e52a298ab92"
    },
    {
        "title": "Throughput-Optimal Scheduling via Rate Learning",
        "author": "Panagiotis Promponas, Víctor Valls, Konstantinos E. Nikolakakis, Dionysis Kalogerias, L. Tassiulas",
        "venue": "IEEE Conference on Decision and Control",
        "year": 2024,
        "url": "https://www.semanticscholar.org/paper/77a922e042a33004904a8766cc99f3befdc5c1fb"
    },
    {
        "title": "Cyber-Twin: Digital Twin-Boosted Autonomous Attack Detection for Vehicular Ad-Hoc Networks",
        "author": "Yagmur Yigit, Ioannis Panitsas, Leandros A. Maglaras, L. Tassiulas, B. Canberk",
        "venue": "ICC 2024 - IEEE International Conference on Communications",
        "year": 2024,
        "url": "https://www.semanticscholar.org/paper/9ce0c5e9b42bc8402b931db99b8f8a6f7703234a"
    }
]